Revit 2027 API
InSessionViewSheetSet.ViewOrganizationId Property
ElementId to the BrowserOrganization for non-sheet views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementId ViewOrganizationId { get; set; }
Public Overridable Property ViewOrganizationId As ElementId
	Get
	Set
public:
virtual property ElementId^ ViewOrganizationId {
	ElementId^ get ();
	void set (ElementId^ value);
}
abstract ViewOrganizationId : ElementId with get, set
override ViewOrganizationId : ElementId with get, set
Property Value
ElementId
Implements
IViewSheetSet.ViewOrganizationId
Exceptions
Exception | Condition
ArgumentException |  Thrown when the ElementId does not reference to BrowserOrganization, or the target type of BrowserOrganization is incompatible.
See Also
Reference
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace